/** <h3>Модули, позволяющие управлять работой Спамоборца.</h3>
 *
 * Пакет {@link spamfighter.model} содержит классы, которые повторяют
 * элементы серверной модели Спамоборца. Могут быть использованы для реализации
 * произвольного взаимодействия с сервером.
 *
 * Пакет {@link spamfighter.lib} содержит вспомогательные классы,
 * например реализацию Deferred из Twisted Framework: {@link spamfighter.lib.Deferred}.
 *
 * Пакет {@link spamfighter.ui} содержит реализацию пользовательского интерфейса системы
 * управления.
 */
